oscillating_airfoil2D/case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0]; 

internalField   uniform 1.42e-4;

boundaryField
{
  far
  {
        type            freestream;
        freestreamValue $internalField;
  }
  background_ymin
  {
    type empty;
  }
  airfoilzone_ymin
  {
    type empty;
  }
  airfoil_surface
  {   
        type    nutUSpaldingWallFunction;
        value   uniform 0.00014612244897959183;
  }   
  #include        "include/cyclicAMI"
}
