oscillating_airfoil2D/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;  
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0]; 

#include        "include/freestreamConditions"
internalField   uniform $p; 

boundaryField
{
  far
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

  background_ymin
  {   
        type            empty;
  }
  airfoilzone_ymin
  {   
        type            empty;
  }
  airfoil_surface
  {   
        type       zeroGradient;
  }   
  #include        "include/cyclicAMI"
}
