oscillating_airfoil2D/case/constant/polyMesh/boundary
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 arch "LSB;label=32;scalar=64";
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

6
(
  far

  {
    type patch;
    nFaces 1200;
    startFace 100477;

  }
  airfoilzone_surface_slave

  {
    type cyclicAMI;
    nFaces 252;
    startFace 101677;
    transform noOrdering;
    neighbourPatch airfoilzone_surface;

  }
  background_ymin

  {
    type empty;
    inGroups
      (
        empty
      );
    nFaces 98476;
    startFace 101929;

  }
  airfoilzone_ymin

  {
    type empty;
    inGroups
      (
        empty
      );
    nFaces 35488;
    startFace 200405;

  }
  airfoilzone_surface

  {
    type cyclicAMI;
    nFaces 252;
    startFace 235893;
    transform noOrdering;
    neighbourPatch airfoilzone_surface_slave;

  }
  airfoil_surface

  {
    type wall;
    nFaces 428;
    startFace 236145;

  }
)
